backend/controllers/EffectuerconsultationController.php

SELECT * FROM `effectuerconsultation` WHERE `ideffectuerconsul`='2'
---
            return $this->render('update', [
                'model' => $model,
                'consultations' => Consultation::find()->all(),
                'detailConsultations' => Detaileffectuerconsultation::find()->where(['ideffectuerconsul' => $model->ideffectuerconsul])->all(),