backend/controllers/PayementController.php

    public function actionCreate($idpatient)
    {
        $model = new Payement();
        $model->idpatient = $idpatient;
        $tau = ($model->idpatient0->tauxassu) / 100;
        $tauPat = 1 - $tau;
        $quot = $tau / $tauPat;

        $analyses = $model->idpatient0->effectueranalysesNonPayer;
        $analysesAss = $model->idpatient0->effectueranalysesNonPayerAss;

        $examens = $model->idpatient0->effectuerexamensNonPayer;
        // $examensAss = $model->idpatient0->effectuerexamensNonPayerAssur;
        $consultations = $model->idpatient0->effectuerconsultationsNonPayer;
        $consultationsAss = $model->idpatient0->effectuerconsultationsNonPayerAssur;

        $achats = $model->idpatient0->achatsNonPayer;
        $achatsAss = $model->idpatient0->achatsNonPayerAss;
        $hospitalisations = $model->idpatient0->hospitalisersNonPayer;
        $hospitalisationsAss = $model->idpatient0->hospitalisersNonPayerAss;
        $soins = $model->idpatient0->donnesoinsNonPayer;
        $soinsAss = $model->idpatient0->donnesoinsNonPayerAss;


        if ($model->load(Yii::$app->request->post())) {
---
SELECT EXISTS(SELECT * FROM `patient` WHERE (`patient`.`idpatient`='4'))

                            $detailPayement->prestation = 'Examen';
                            $detailPayement->codeprestation = '' . $examen->idexamen;
                            $detailPayement->montant = $examen->idexamen0->idtypeexamen0->coutexamen;
                            $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `detailprestation`, `codeprestation`, `montant`) VALUES (3, 'Consultation', 'CONSULTATION PEDIATRIQUE', '19', '7500')

                            $detailPayement->codeprestation = '' . $hospitalisation->idhospitalisation;
                            $detailPayement->detailprestation = $hospitalisation->idchbre0->nomchbre;
                            $detailPayement->montant = $hospitalisation->total;
                            $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `codeprestation`, `montant`, `detailprestation`) VALUES (3, 'Soin', '14', '200', 'Spasfon')

                                $detailPayement->prestation = 'Analyse';
                                $detailPayement->codeprestation = '' . $analyse->idanalysemedicale;
                                $detailPayement->montant = $analyse->coutanalyse*$tau;
                                $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `codeprestation`, `detailprestation`, `montant`) VALUES (10, 'Analyse', '96', 'NFS1', '3000')

                            $detailPayement->prestation = 'Consultation';
                            $detailPayement->codeprestation = '' . $consultation->ideffectuerconsul;
                            $detailPayement->montant = $consultation->total * $quot;
                            $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `detailprestation`, `codeprestation`, `montant`) VALUES (10, 'Consultation', 'CONSULTATION GENERALE', '2', '4500')

                    // Traitement des achats
                    /*       foreach ($achatsAss as $achat) {
                               $achat->payerassuran = 1;
                               if ($achat->save()) {
---
UPDATE `achat` SET `payerassuran`=1 WHERE `idachat`=2

                                   $detailPayement->prestation = 'Pharmacie';
                                   $detailPayement->codeprestation = '' . $achat->idachat;
                                   $detailPayement->montant = $achat->total;
                                   $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `codeprestation`, `detailprestation`, `montant`) VALUES (10, 'Pharmacie', '2', 'Cofantrine', '7500')

                                $detailPayement->codeprestation = '' . $achat->idachat;
                                $detailPayement->detailprestation = $achat->idproduit0->libproduit;
                                $detailPayement->montant = $achat->coutproduit * $achat->qteprod * $tau;
                                $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `codeprestation`, `montant`, `detailprestation`) VALUES (10, 'Hospitalisation', '16', '16875', 'ALEDJO')

                            $detailPayement->codeprestation = '' . $hospitalisation->idhospitalisation;
                            $detailPayement->montant = $hospitalisation->total * $quot;
                            $detailPayement->detailprestation = $hospitalisation->idchbre0->nomchbre;
                            $detailPayement->save();
---
INSERT INTO `detailpayement` (`idpayement`, `prestation`, `codeprestation`, `montant`, `detailprestation`) VALUES (10, 'Soin', '4', '1464', 'SGI 250')