backend/controllers/PayementController.php

    public function actionCreate($idpatient)
    {
        $model = new Payement();
        $model->idpatient = $idpatient;
        $tau = ($model->idpatient0->tauxassu) / 100;
        $tauPat = 1 - $tau;
        $quot = $tau / $tauPat;

        $analyses = $model->idpatient0->effectueranalysesNonPayer;
        $analysesAss = $model->idpatient0->effectueranalysesNonPayerAss;

        $examens = $model->idpatient0->effectuerexamensNonPayer;
        // $examensAss = $model->idpatient0->effectuerexamensNonPayerAssur;
        $consultations = $model->idpatient0->effectuerconsultationsNonPayer;
        $consultationsAss = $model->idpatient0->effectuerconsultationsNonPayerAssur;

        $achats = $model->idpatient0->achatsNonPayer;
        $achatsAss = $model->idpatient0->achatsNonPayerAss;
        $hospitalisations = $model->idpatient0->hospitalisersNonPayer;
        $hospitalisationsAss = $model->idpatient0->hospitalisersNonPayerAss;
        $soins = $model->idpatient0->donnesoinsNonPayer;
        $soinsAss = $model->idpatient0->donnesoinsNonPayerAss;


        if ($model->load(Yii::$app->request->post())) {
---
SELECT EXISTS(SELECT * FROM `patient` WHERE (`patient`.`idpatient`=4))