backend/views/prelevement/resultat.php

    //var_dump($idAna);exit;
    ?>

    <?= $form->field($model, 'idpatient')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Patient::find()->all(), 'idpatient', 'fullName'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner un patient ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>
    <!--?= yii\bootstrap\Progress::widget(['percent' => 80, 'label' => 'test']) ?-->

    <?= $form->field($model, 'idanalysemedicale')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Prelevement::find()->joinWith(['idanalysemedicale0'])->where(['idprelevement'=>$model->idprelevement])->andWhere(['statutresul'=>0])->all(),'idanalysemedicale','idanalysemedicale0.libanalysemedicale'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner l\'analyse ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>
---
SELECT * FROM `patient`
SELECT `prelevement`.* FROM `prelevement` LEFT JOIN `analysemedicale` ON `prelevement`.`idanalysemedicale` = `analysemedicale`.`idanalysemedicale` WHERE (`idprelevement`=41) AND (`statutresul`=0)