backend/views/antecedant/_form.php

    <?php $form = ActiveForm::begin(); ?>


    <?= $form->field($model, 'idpatient')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Patient::find()->all(), 'idpatient', 'fullName'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner un patient ...'],
        'pluginOptions' => [
            'allowClear' => true

        ],
    ]); ?>



    <?= $form->field($model, 'familiaux[]')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Antecedant1::find()->where(['antecedant1.idtypeantecedant'=>1])->all(),'idancedant1','libelleantecant1'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner antécédants familiaux ...'],
        'pluginOptions' => [
            'multiple' => true
        ],
    ]); ?>
---
SELECT * FROM `patient`
SELECT * FROM `antecedant1` WHERE `antecedant1`.`idtypeantecedant`=1

    echo $form->field($model, 'familiaux')->dropDownList($a,['prompt'=>'Selectionnez un rhésus']);
    ?-->

    <?= $form->field($model, 'medicaux')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Antecedant1::find()->where(['antecedant1.idtypeantecedant'=>5])->all(),'idancedant1','libelleantecant1'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner antécédants Médicaux ...'],
        'pluginOptions' => [
            'multiple' => true
        ],
    ]); ?>


    <?= $form->field($model, 'chirurgicaux')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Antecedant1::find()->where(['antecedant1.idtypeantecedant'=>3])->all(),'idancedant1','libelleantecant1'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner antécédants Chirurgicaux ...'],
        'pluginOptions' => [
            'multiple' => true
        ],
    ]); ?>
---
SELECT * FROM `antecedant1` WHERE `antecedant1`.`idtypeantecedant`=5
SELECT * FROM `antecedant1` WHERE `antecedant1`.`idtypeantecedant`=3