backend/views/demanderanalyse/_pform.php

SELECT `detaildemandeanalyse`.* FROM `detaildemandeanalyse` LEFT JOIN `analysemedicale` ON `detaildemandeanalyse`.`idanalysemedicale` = `analysemedicale`.`idanalysemedicale` WHERE (`iddemandeanalyse`=16) AND (`statut`=0)
SELECT * FROM `aspectprelevement`
---

    <?= $form->field($model, 'iddemandeanalyse')->textInput(['readonly'=>true])->label('Numero demande') ?>
    <input type="text"  class="form-control"  value="<?= $model->idpatient0->fullName ?>" readonly="readonly" aria-required="true">
    <?= $form->field($prelevement, 'idanalysemedicale')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Detaildemandeanalyse::find()->joinWith(['idanalysemedicale0'])->where(['iddemandeanalyse'=>$model->iddemandeanalyse])->andWhere(['statut'=>0])->all(),'idanalysemedicale','idanalysemedicale0.libanalysemedicale'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner l\'analyse ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>

    <?= $form->field($prelevement, 'idaspectprelevement')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Aspectprelevement::find()->all(),'idaspectprelevement','libeapect'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner aspect du prélèvement...'],
        'pluginOptions' => [
            'multiple' => true
        ],
    ]); ?>