backend/views/effectueranalyse/_form.php

    //echo '<pre>';var_dump($idAna['idprelevement']);exit;
    ?>

    <?= $form->field($model, 'idpatient')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Patient::find()->all(), 'idpatient', 'fullName'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner un patient ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>

    <?= $form->field($model, 'idanalysemedicale')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Prelevement::find()->joinWith(['idanalysemedicale0'])->where(['idprelevement'=>$idAna['idprelevement']])->andWhere(['statutresul'=>1])->all(),'idanalysemedicale','idanalysemedicale0.libanalysemedicale'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner l\'analyse ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>
---
SELECT * FROM `patient`
SELECT `prelevement`.* FROM `prelevement` LEFT JOIN `analysemedicale` ON `prelevement`.`idanalysemedicale` = `analysemedicale`.`idanalysemedicale` WHERE (`idprelevement`='57') AND (`statutresul`=1)