backend/models/DetailpayementSearch.php

SELECT * FROM `detailpayement` WHERE `idpayement`=1
---
    public function searchByPayement($id_payement, $params)
    {
        $query = Detailpayement::find();
        $query->where(['idpayement'=>$id_payement])->all();