backend/models/PayementSearch.php

    public function getTotalEntree($params){
        $query = Payement::find()->sum('montantrecu');
---
SELECT SUM(montantrecu) FROM `payement`

    public function getTotalCaisse($params)
    {

        $query = Payement::find()->sum('montantrecu');

        $query2 = Decaissement::find()->sum('montant');
---
SELECT SUM(montant) FROM `decaissement`