backend/views/patient/_form.php

    <?= $form->field($model, 'nompatient')->textInput(['maxlength' => true,'autofocus' => 'autofocus']) ?>

    <?= $form->field($model, 'prenompatient')->textInput(['maxlength' => true]) ?>
    <?= $form->field($model, 'idassurance')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Assurance::find()->all(),'idassurance','libassurance'),
        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner une assurance ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>
---
SELECT * FROM `assurance`