backend/views/achat/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'idpatient')->widget(Select2::classname(), [
        'data' => \yii\helpers\ArrayHelper::map(\backend\models\Patient::find()->all(), 'idpatient', 'fullName'),

        'language' => 'fr',
        'options' => ['placeholder' => 'Selectionner un patient ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ])->label('Patient'); ?>
---
SELECT * FROM `patient`

                        </td>
                        <td>
                            <select class="form-control m-b" id="produits" name="produits[]">
                                <?php foreach(\backend\models\Produit::find()->all() as $produit) {  ?>
---
SELECT * FROM `produit`